tiwater/ticos-sdk-for-c/observability/ticos-firmware-sdk/ports/zephyr/ncs/src/ticos_nrf91_root_cert_storage.c
//! @file
//!
//! Copyright (c) Ticos, Inc.
//! See License.txt for details
//!
//! When using the nRF9160, certificates cannot be added via Zephyrs
//! tls_credential_add() API. Instead they need to be added using the
//! modem management API which is what this port does.

#include "ticos/ports/zephyr/root_cert_storage.h"

#include <string.h>

//! Between nrf-connect-sdk v1.2.1 and v1.4 the locations of some headers changed.
//! We use __has_include() to support both paths so the port works with either SDK
//! version.
#if __has_include("zephyr/types.h")
#include "zephyr/types.h"
#endif

#if __has_include("modem/modem_key_mgmt.h")
#include "modem/modem_key_mgmt.h"
#else
#include <modem_key_mgmt.h>
#endif

#include "ticos/core/debug_log.h"
#include "ticos/ports/ncs/version.h"


int ticos_root_cert_storage_add(
    eTicosRootCert cert_id, const char *cert, size_t cert_length) {
  bool exists;

// Note: modem_key_mgmt_exists() signature changed between nRF Connect SDK 1.7 & 1.8
//   https://github.com/nrfconnect/sdk-nrf/pull/5631
#if TICOS_NCS_VERSION_GT(1, 7)
  int err = modem_key_mgmt_exists(cert_id, MODEM_KEY_MGMT_CRED_TYPE_CA_CHAIN, &exists);
#else
  uint8_t unused;
  int err = modem_key_mgmt_exists(cert_id, MODEM_KEY_MGMT_CRED_TYPE_CA_CHAIN,
                                  &exists, &unused);
#endif

  if (err != 0) {
    TICOS_LOG_ERROR("Failed to install cert %d, rv=%d\n", cert_id, err);
    return err;
  }

  if (exists) {
    return 0;
  }

  TICOS_LOG_INFO("Installing Root CA %d", cert_id);
  err = modem_key_mgmt_write(cert_id, MODEM_KEY_MGMT_CRED_TYPE_CA_CHAIN,
                             cert, strlen(cert));
  if (err != 0) {
    TICOS_LOG_ERROR("Failed to provision certificate, err %d\n", err);
  }

  return err;
}
